Revit 2024 API
IDuctPressureDropServer.GetInformationLink Method
 The method that Revit will invoke to obtain a URL address which provides more information about the server.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
string GetInformationLink()
Visual Basic
Function GetInformationLink As String
Visual C++
String^ GetInformationLink()
Return Value
 The URL providing server information.
See Also
IDuctPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace